# Задание 1
# Программа выводит приветствие с введенным именем.

name = input("Введите имя: ")
print(f"приветствуем вас, уважаемый {name}.")
